package generics;

import java.util.*;

public class B00_GenericInfo {
	
/*
 * 
 * Generics ในภาษา Java เป็นฟีเจอร์ที่ช่วยให้เราสามารถสร้างคลาส, อินเทอร์เฟซ 
 * และเมธอดที่ทำงานกับชนิดข้อมูลใด ๆ ก็ได้ โดยไม่จำเป็นต้องระบุชนิดข้อมูลล่วงหน้า 
 * ฟีเจอร์นี้ทำให้โค้ดยืดหยุ่นและปลอดภัยมากขึ้น และช่วยป้องกันข้อผิดพลาดที่เกี่ยวกับชนิดข้อมูลในขณะรันไทม์
 * 
 * 		ทำไมต้องใช้ Generics?
 * 	1.ความปลอดภัยของชนิดข้อมูล (Type Safety): Generics ช่วยให้เราระบุชนิดข้อมูลตอนคอมไพล์ 
 * 		ทำให้ลดความเสี่ยงของข้อผิดพลาดประเภท ClassCastException ในขณะรันไทม์
 * 	2. การนำกลับมาใช้ซ้ำ (Reusability): เราสามารถสร้างคลาสหรือเมธอดที่ใช้ได้กับหลายชนิดข้อมูลโดยไม่ต้องเขียนโค้ดซ้ำ
 * 	3. ความชัดเจนและบำรุงรักษาได้ง่าย: Generics ทำให้โค้ดดูเข้าใจง่ายขึ้น เพราะชนิดข้อมูลถูกระบุไว้อย่างชัดเจน
*/

	public static void main(String[] args) {
	

	}

}
